import { createContext, useContext } from 'react';

export const defaultProduct = {
  id: '6634885c1bc9a74b28287f1d',
  title: 'Імя продукту може бути довгим',
  price: '968',
  eco: true,
  discount: true,

  discountItem: '799',

  visit: 0,

  category: 'Навушники',

  producer: { _id: '662c019b7b02e623f5c5fb45', firstName: 'Serhii' },

  subCategory: 'Вакуумні',

  img: 'https://i.ibb.co/SBKBZ3K/headphones.jpg',
  state: 'Нове',
  size: ' L',

  describe: `Насолоджуйтесь кришталево чистим звуком та бездоганним комфортом з нашими передовими бездротовими навушниками. Використовуючи передову технологію звукового відтворення, ці навушники відтворюють кожну ноту з неймовірною ясністю та глибиною, переносячи вас у світ музики з новими емоціями. Зручна конструкція з м'якими амбушурами та регульованим облямовуванням дозволяє насолоджуватися бездоганним звуком протягом годин без будь-якого дискомфорту. Вбудований акумулятор забезпечує довгу автономну роботу, що робить ці навушники ідеальними для використання вдома, в дорозі або під час активного спорту.`,

  createDate: '2024-05-03T06:46:52.985+00:00',
  comments: [
    {
      id: '6634886c1bc9a74b28287f25',
      body: `Ці навушники - справжня знахідка для всіх, хто цінує високу якість звуку та комфорт під час прослуховування музики, перегляду відео або геймінгу.`,

      like: [],
      dislike: [],

      author: 'Іван',
      product: '6634885c1bc9a74b28287f1d',
      createDate: '2024-05-03T06:47:08.810+00:00',
    },
    {
      id: '6634886c1bc9a74b28287f25',
      body: `Ці навушники - справжня знахідка для всіх, хто цінує високу якість звуку та комфорт під час прослуховування музики, перегляду відео або геймінгу.`,

      like: [],
      dislike: [],

      author: 'Іван',
      product: '6634885c1bc9a74b28287f1d',
      createDate: '2024-05-03T06:47:08.810+00:00',
    },
  ],
};

export const ProductPageContext = createContext(null);

export const useProductPageContext = () => {
  const props = useContext(ProductPageContext);
  if (!props) {
    throw new Error('some thing wrong...');
  }
  return props;
};
