import { Container } from './ConfederacyComponent.styled';

export default function ConfederacyComponent() {
  return (
    <Container>
      <h1>Політика конфіденційності</h1>
      <ul>
        <li>
          <h2>1. Збір інформації</h2>
          <p>
            1.1. Платформа збирає інформацію, яку користувачі надають під час
            реєстрації та користування Платформою, включаючи ім'я, контактні
            дані, та іншу особисту інформацію.
          </p>
        </li>
        <li>
          <h2>2. Використання інформації</h2>
          <p>
            2.1. Інформація використовується для надання послуг, підтримки
            користувачів, та покращення роботи Платформи.
          </p>
          <p>
            2.2. Інформація може бути використана для маркетингових цілей, але
            тільки з попередньою згодою користувача.
          </p>
        </li>
        <li>
          <h2>3. Передача інформації третім особам</h2>
          <p>
            3.1. Платформа не передає особисту інформацію користувачів третім
            особам без їхньої згоди, за винятком випадків, передбачених законом.
          </p>
        </li>
        <li>
          <h2>4. Захист інформації</h2>
          <p>
            4.1. Платформа використовує сучасні засоби захисту для забезпечення
            безпеки особистої інформації користувачів.
          </p>
        </li>
        <li>
          <h2>5. Права користувачів</h2>
          <p>
            5.1. Користувач має право на доступ до своєї особистої інформації та
            її виправлення.
          </p>
          <p>
            5.2. Користувач має право вимагати видалення своєї особистої
            інформації з Платформи.
          </p>
        </li>
        <li>
          <h2>6. Зміни в Політиці конфіденційності</h2>
          <p>
            6.1. Адміністрація залишає за собою право змінювати умови цієї
            Політики. Про зміни користувачі будуть повідомлені через Платформу.
          </p>
        </li>
      </ul>
    </Container>
  );
}
